[
    {
    "id": 0,
    "lat": 25.12488323571715,
    "lng": 55.38071169049753,
    "country": "Emiratos Árabes Unidos",
    "city": "Dubai",
    "role": "Technical Lead - Box Sells Ops",
    "company": "Hawk-Eye Innovations Ltd.",
    "companyLink": "https://www.hawkeyeinnovations.com/",
    "start": "May/2025",
    "end": null,
    "experience": [
      "Punto de contacto técnico principal para operaciones críticas y resolución de escalaciones de clientes.",
      "Mantenimiento y organización de actualizaciones del sistema, asegurando cumplimiento con estándares globales.",
      "Redacción y mantenimiento de documentación técnica para apoyar a equipos internos y operaciones de clientes.",
      "Liderazgo en implementaciones, incluyendo el despliegue de un centro de operaciones remoto en Uzbekistán.",
      "Supervisión de operaciones críticas de mantenimiento, reparación y actualización remotas con tiempo de inactividad mínimo.",
      "Diseño y entrega de guías de capacitación técnica para mejorar las habilidades del personal de ingeniería regional.",
      "Colaboración en el diseño, implementación y pruebas de una nueva interfaz de usuario para mejorar la usabilidad del sistema para personal nuevo o externo."
    ],
    "image": ""
  },
  {
    "id": 1,
    "lat": 25.12488323571715,
    "lng": 55.38071169049753,
    "country": "Emiratos Árabes Unidos",
    "city": "Dubai",
    "role": "VAR Technical Lead - EAU Ops",
    "company": "Hawk-Eye Innovations Ltd.",
    "companyLink": "https://www.hawkeyeinnovations.com/",
    "start": "Feb/2024",
    "end": "May/2025",
    "experience": [
      "Operación y soporte de sistemas VAR (Video Assistant Referee) en competiciones locales e internacionales.",
      "Participación clave en la implementación del Protocolo de Anuncios Públicos en torneos importantes de Emiratos Árabes Unidos, incluyendo la Final de la ADIB Cup y la President’s Cup.",
      "Aseguramiento del cumplimiento de estándares internacionales y mantenimiento de actualizaciones de software y hardware.",
      "Coordinación con árbitros, broadcasters e ingenieros para garantizar operaciones sin contratiempos durante los partidos.",
      "Resolución de problemas en tiempo real bajo presión en entornos de competición en vivo."
    ],
    "image": ""
  },
  {
    "id": 2,
    "lat": -2.111724064549847,
    "lng": -79.9093573817597,
    "country": "Ecuador",
    "city": "Guayaquil",
    "role": "Junior VAR Technical Lead -  Ecuador Ops",
    "company": "Hawk-Eye Innovations Ltd.",
    "companyLink": "https://www.hawkeyeinnovations.com/",
    "start": "Abr/2022",
    "end": "Feb/2024",
    "experience": [
      "Gestioné pruebas de campo y lanzamientos de producción para la región.",
      "Establecí políticas y estandaricé el despliegue de equipos para una coordinación efectiva.",
      "Lideré la gestión de inventarios y serví como punto principal de contacto para el gerente de proyecto.",
      "Investigé y resolví problemas técnicos y consultas de clientes."
    ],
    "image": ""
  },
  {
    "id": 3,
    "lat": -2.1923905830528607,
    "lng": -79.88292921927294,
    "country": "Ecuador",
    "city": "Guayaquil",
    "role": "Practicante Desarrollador de Sistemas",
    "company": "Tiendas Industriales Asociadas S.A.",
    "companyLink": "https://reclutamiento.tia.com.ec/",
    "start": "Mar/2022",
    "end": "Jun/2022",
    "experience": [
      "Diseñé, desarrollé y documenté una API REST para el sistema ERP Idempiere.",
      "Programé principalmente en Java, utilizando patrones de diseño como builder y factory.",
      "Colaboré con el equipo de proyectos especiales para crear una app móvil interna para monitoreo en tiempo real de stock, inventario y descuentos.",
      "Utilicé Postman para pruebas de API y MySQL para gestión de base de datos, implementando sentencias complejas para transacciones sincronizadas."
    ],
    "image": ""
  },
  {
    "id": 4,
    "lat": -2.1516590399599687,
    "lng": -79.95689337146995,
    "country": "Ecuador",
    "city": "Guayaquil",
    "role": "Practicante de Gestión de Redes, Web y TI",
    "company": "Centro de Investigación, Desarrollo e Innovación de Sistemas Computacionales",
    "companyLink": "https://www.cidis.espol.edu.ec/",
    "start": "Oct/2021",
    "end": "Feb/2022",
    "experience": [
      "Realicé seguimiento del inventario prestado, instalé equipos de red y ejecuté actualizaciones de servidores.",
      "Solucioné problemas y mantuve los equipos de investigación, manejando la adquisición para mejoras y nuevos equipos.",
      "Ejecuté tareas de mantenimiento correctivo y preventivo, asegurando el buen funcionamiento de los sistemas."
    ],
    "image": ""
  }
]
